const errorMessages = {
    emptyEmail: 'Введите адрес электронной почты или номер телефона.',
    invalidEmail: 'Введен некорректный адрес электронной почты.',
    invalidPhoneNumber: 'Введен некорректный номер телефона.',
    emptyName: 'Введите имя.',
    invalidName: 'Проверьте правильность своего имени.',
    invalidSurname: 'Проверьте правильность своей фамилии.',
    invalidDate: 'Укажите правильную дату.',
    emptyDate: 'Введите дату полностью.',
    emptyGender: 'Укажите свой пол.',
    emptyCode: 'Введите код подтверждения.',
    invalidCode: 'Код подтверждения неверный, проверьте правильность введенных данных.',
    passwordLength: 'Пароль должен содержать от 8 до 12 символов.',
    passwordUpperCase: 'Пароль должен включать в себя заглавные буквы.',
    passwordLowerCase: 'Пароль должен включать в себя строчные буквы.',
    passwordDigits: 'Пароль должен включать в себя цифры',
    passwordSpecialChars: 'Пароль должен включать в себя специальные символы: !@#$%.',
    passwordConfirm: 'Пароли должны совпадать.'
}

export default errorMessages;